**package dependencies**
- pandas=1.4.3
- sklearn=1.1.1
- matplotlib=3.5.2
- jupyterlab=3.4.3
- python=3.9.13

In [1]:
import pandas as pd
df = pd.read_csv('Mall_Customers.csv')
df.head(2)

   CustomerID Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1   Male   19                  15                      39
1           2   Male   21                  15                      81

In [2]:
df.rename(columns={'Spending Score (1-100)':'Spending','Annual Income (k$)':'Annual Income'},inplace=True)

In [3]:
df.head(2)

   CustomerID Gender  Age  Annual Income  Spending
0           1   Male   19             15        39
1           2   Male   21             15        81

In [4]:
rel_cols = ['Age','Annual Income','Spending']
df_rel = df[rel_cols]

In [5]:
df_rel.head(2)

   Age  Annual Income  Spending
0   19             15        39
1   21             15        81

### Standardize the numeric values

In [6]:
from sklearn.preprocessing import StandardScaler
X = df_rel.values

In [7]:
scaler = StandardScaler()
x_scaled = scaler.fit_transform(X)

### Make a cluster model (N clusters = 4)

In [8]:
from sklearn.cluster import KMeans
mod1 = KMeans(n_clusters=4)
mod1 = mod1.fit(x_scaled)

In [9]:
mod1.labels_ ### cluster labels

array([2, 2, 2, 2, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 2, 2, 1, 2, 2, 2,
       1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2,
       1, 2, 1, 2, 2, 2, 1, 2, 2, 1, 1, 1, 1, 1, 2, 1, 1, 2, 1, 1, 1, 2,
       1, 1, 2, 2, 1, 1, 1, 1, 1, 2, 1, 1, 2, 1, 1, 2, 1, 1, 2, 1, 1, 2,
       2, 1, 1, 2, 1, 1, 2, 2, 1, 2, 1, 2, 2, 1, 1, 2, 1, 2, 1, 1, 1, 1,
       1, 2, 0, 2, 2, 2, 1, 1, 1, 1, 2, 0, 3, 3, 0, 3, 0, 3, 1, 3, 0, 3,
       0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3,
       0, 3, 0, 3, 0, 3, 1, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3,
       0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3, 0, 3,
       0, 3], dtype=int32)

In [10]:
df['cluster_4'] = mod1.labels_
df.head()

   CustomerID  Gender  Age  Annual Income  Spending  cluster_4
0           1    Male   19             15        39          2
1           2    Male   21             15        81          2
2           3  Female   20             16         6          2
3           4  Female   23             16        77          2
4           5  Female   31             17        40          2